{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<bos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<eos>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<pad>": 0,
      "<bos>": 1,
      "<eos>": 2,
      "<unk>": 3,
      "!": 4,
      "\"": 5,
      "#": 6,
      "$": 7,
      "%": 8,
      "&": 9,
      "'": 10,
      "(": 11,
      ")": 12,
      "*": 13,
      "+": 14,
      ",": 15,
      "-": 16,
      ".": 17,
      "/": 18,
      "0": 19,
      "1": 20,
      "2": 21,
      "3": 22,
      "4": 23,
      "5": 24,
      "6": 25,
      "7": 26,
      "8": 27,
      "9": 28,
      ":": 29,
      ";": 30,
      "<": 31,
      "=": 32,
      ">": 33,
      "?": 34,
      "@": 35,
      "A": 36,
      "B": 37,
      "C": 38,
      "D": 39,
      "E": 40,
      "F": 41,
      "G": 42,
      "H": 43,
      "I": 44,
      "J": 45,
      "K": 46,
      "L": 47,
      "M": 48,
      "N": 49,
      "O": 50,
      "P": 51,
      "Q": 52,
      "R": 53,
      "S": 54,
      "T": 55,
      "U": 56,
      "V": 57,
      "W": 58,
      "X": 59,
      "Y": 60,
      "Z": 61,
      "[": 62,
      "\\": 63,
      "]": 64,
      "^": 65,
      "_": 66,
      "`": 67,
      "a": 68,
      "b": 69,
      "c": 70,
      "d": 71,
      "e": 72,
      "f": 73,
      "g": 74,
      "h": 75,
      "i": 76,
      "j": 77,
      "k": 78,
      "l": 79,
      "m": 80,
      "n": 81,
      "o": 82,
      "p": 83,
      "q": 84,
      "r": 85,
      "s": 86,
      "t": 87,
      "u": 88,
      "v": 89,
      "w": 90,
      "x": 91,
      "y": 92,
      "z": 93,
      "{": 94,
      "|": 95,
      "}": 96,
      "~": 97,
      "¬": 98,
      "â": 99,
      "Ċ": 100,
      "č": 101,
      "Ġ": 102,
      "Ģ": 103,
      "Ĥ": 104,
      "Į": 105,
      "Ĳ": 106,
      "Ķ": 107,
      "ĺ": 108,
      "Ļ": 109,
      "ľ": 110,
      "Ŀ": 111,
      "ĠĠ": 112,
      "čĊ": 113,
      "ččĊ": 114,
      "ĠĠĠĠ": 115,
      "in": 116,
      "er": 117,
      "ut": 118,
      "ĠĠĠĠĠĠĠĠ": 119,
      "Ġin": 120,
      "Ġt": 121,
      "put": 122,
      "//": 123,
      "--": 124,
      "re": 125,
      "lo": 126,
      "st": 127,
      "Ġa": 128,
      "Ġp": 129,
      "Ġinput": 130,
      "at": 131,
      "or": 132,
      "en": 133,
      "ic": 134,
      "le": 135,
      "on": 136,
      "Ġc": 137,
      "ĠĠĠ": 138,
      "he": 139,
      "ar": 140,
      "im": 141,
      "Ġlo": 142,
      "it": 143,
      "de": 144,
      "Ġo": 145,
      "Ġs": 146,
      "Ġb": 147,
      "gic": 148,
      "am": 149,
      "Ġlogic": 150,
      "al": 151,
      "Ġ//": 152,
      "et": 153,
      "Ġthe": 154,
      "----": 155,
      "Ġ[": 156,
      "mo": 157,
      "Ġ=": 158,
      "du": 159,
      "ed": 160,
      "Ġ(": 161,
      "es": 162,
      "Ġf": 163,
      "dule": 164,
      "module": 165,
      "ct": 166,
      "as": 167,
      "an": 168,
      "aram": 169,
      "is": 170,
      "Ġd": 171,
      "lk": 172,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 173,
      "ion": 174,
      "Ġr": 175,
      "::": 176,
      "pk": 177,
      "Ġ.": 178,
      "pkg": 179,
      "ro": 180,
      "ata": 181,
      "aramet": 182,
      "arameter": 183,
      "ing": 184,
      "Ġparameter": 185,
      "Ġout": 186,
      "Ġint": 187,
      "Ġto": 188,
      "Ġoutput": 189,
      "ig": 190,
      "ck": 191,
      "rim": 192,
      "if": 193,
      "ert": 194,
      "ort": 195,
      "Ġw": 196,
      "port": 197,
      "nd": 198,
      "Ġre": 199,
      "co": 200,
      "id": 201,
      ");": 202,
      "Ġim": 203,
      "th": 204,
      "Ġclk": 205,
      "ul": 206,
      "ec": 207,
      "Ġu": 208,
      "Ġprim": 209,
      "ni": 210,
      "ac": 211,
      "--------": 212,
      "ent": 213,
      "ign": 214,
      "00": 215,
      "Ġimport": 216,
      "Ġm": 217,
      "ĠI": 218,
      "Ġrst": 219,
      "Ġ1": 220,
      "ĠS": 221,
      "err": 222,
      "Ġbe": 223,
      "ĠT": 224,
      "um": 225,
      "////": 226,
      "Ġfor": 227,
      "::*": 228,
      "::*;": 229,
      "nt": 230,
      "ĠĠĠĠĠĠĠ": 231,
      "ad": 232,
      "reg": 233,
      "idth": 234,
      "ĠC": 235,
      "Ġis": 236,
      "gr": 237,
      "ĠD": 238,
      "ation": 239,
      "Ġof": 240,
      "Width": 241,
      "Ġand": 242,
      "est": 243,
      "data": 244,
      "Ġdata": 245,
      "#(": 246,
      "Ġde": 247,
      "Ġal": 248,
      "rl": 249,
      "rst": 250,
      "ass": 251,
      "ctrl": 252,
      "Ġth": 253,
      "ded": 254,
      "ub": 255,
      "ve": 256,
      "ĠR": 257,
      "clk": 258,
      "lock": 259,
      "ab": 260,
      "Ġh": 261,
      "il": 262,
      "ĠĠĠĠĠĠĠĠĠĠĠĠ": 263,
      "Ġtl": 264,
      "Ġco": 265,
      "Ġbit": 266,
      "ip": 267,
      "ag": 268,
      "Ġ*": 269,
      "](": 270,
      "tp": 271,
      "se": 272,
      "sign": 273,
      "./": 274,
      "Ġas": 275,
      "end": 276,
      "ver": 277,
      "able": 278,
      "../": 279,
      "ĠA": 280,
      "ect": 281,
      "mgr": 282,
      "ĠP": 283,
      "ubi": 284,
      "rom": 285,
      "assert": 286,
      "tl": 287,
      "ĠO": 288,
      "ch": 289,
      "low": 290,
      "),": 291,
      "ib": 292,
      "Ġn": 293,
      "Ġst": 294,
      "Ġ#(": 295,
      "gen": 296,
      "ex": 297,
      "Ġcon": 298,
      "em": 299,
      "ce": 300,
      "ol": 301,
      "us": 302,
      "ash": 303,
      "Ġon": 304,
      "sv": 305,
      "ind": 306,
      "Ġ^": 307,
      "Ġsy": 308,
      "ith": 309,
      "oc": 310,
      "ke": 311,
      "Num": 312,
      "op": 313,
      "wa": 314,
      "ist": 315,
      "ĠĠĠĠĠ": 316,
      "Ġ`": 317,
      "erf": 318,
      "32": 319,
      "un": 320,
      "ard": 321,
      "Ġl": 322,
      "ate": 323,
      "erfac": 324,
      "Ġun": 325,
      "ly": 326,
      "////////": 327,
      "##": 328,
      "mubi": 329,
      "Ġtlul": 330,
      "----------------": 331,
      "sec": 332,
      "ain": 333,
      "io": 334,
      "Ġ&": 335,
      "pl": 336,
      "Ġerr": 337,
      "hw": 338,
      "ity": 339,
      "vic": 340,
      "ot": 341,
      "Ġwith": 342,
      "ĠE": 343,
      "heck": 344,
      "vice": 345,
      "../../": 346,
      "sr": 347,
      "ur": 348,
      "signed": 349,
      "ht": 350,
      "and": 351,
      "Ġen": 352,
      "Ġby": 353,
      "ction": 354,
      "secded": 355,
      "el": 356,
      "Ġ0": 357,
      "cl": 358,
      "Ġ\"": 359,
      "Ġunsigned": 360,
      "Ġ|": 361,
      "val": 362,
      "wr": 363,
      "up": 364,
      "ow": 365,
      "cal": 366,
      "om": 367,
      "ĠB": 368,
      "Ġ2": 369,
      "Ġ^(": 370,
      "fer": 371,
      "pec": 372,
      "ire": 373,
      "uf": 374,
      "yp": 375,
      "his": 376,
      "res": 377,
      "clu": 378,
      "Ġ);": 379,
      "ĠM": 380,
      "yn": 381,
      "core": 382,
      "ated": 383,
      "Ġres": 384,
      "ĠĠĠĠĠĠĠĠĠ": 385,
      "ment": 386,
      "ndrom": 387,
      "ndrome": 388,
      "ject": 389,
      "art": 390,
      "Ġus": 391,
      "clude": 392,
      "vi": 393,
      "Ġtest": 394,
      "req": 395,
      "gin": 396,
      "tps": 397,
      "ĠH": 398,
      "://": 399,
      "iz": 400,
      "Ġreg": 401,
      "int": 402,
      "0000": 403,
      "ĠF": 404,
      "Ġthat": 405,
      "Ġcom": 406,
      "https": 407,
      "bo": 408,
      "dr": 409,
      "her": 410,
      "Ġsign": 411,
      "Ġbegin": 412,
      "md": 413,
      "ult": 414,
      "pecif": 415,
      "ap": 416,
      "ĠThe": 417,
      "Ġalert": 418,
      "age": 419,
      "Ġlocal": 420,
      "Ġ-": 421,
      "ĠInt": 422,
      "ack": 423,
      "Ġit": 424,
      "ibex": 425,
      "Ġbind": 426,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 427,
      "Ġerror": 428,
      "AD": 429,
      "ware": 430,
      "ial": 431,
      "prim": 432,
      "fp": 433,
      "mac": 434,
      "pi": 435,
      "ys": 436,
      "64": 437,
      "lert": 438,
      "**": 439,
      "lop": 440,
      "com": 441,
      "Ġsignal": 442,
      "dv": 443,
      "Ġlocalp": 444,
      "Ġclock": 445,
      "Ġan": 446,
      "org": 447,
      "Ġlocalparam": 448,
      "include": 449,
      "fpv": 450,
      "Ġthis": 451,
      "Ġ**": 452,
      "qu": 453,
      "Ġg": 454,
      "FF": 455,
      "itan": 456,
      "Ġpro": 457,
      "unction": 458,
      "erfaces": 459,
      "ĠĠĠĠĠĠĠĠĠĠ": 460,
      "Ġsyndrome": 461,
      "out": 462,
      "ync": 463,
      "lash": 464,
      "ple": 465,
      "ĠW": 466,
      "31": 467,
      "ler": 468,
      "tr": 469,
      "ĠV": 470,
      "tb": 471,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 472,
      "po": 473,
      "test": 474,
      "ive": 475,
      "ep": 476,
      "Ġare": 477,
      "to": 478,
      "ĠN": 479,
      "unt": 480,
      "Ġcheck": 481,
      "ĠIn": 482,
      "yc": 483,
      "Ġ<": 484,
      "per": 485,
      "key": 486,
      "Ġreset": 487,
      "endmodule": 488,
      "ication": 489,
      "ĠEn": 490,
      "ha": 491,
      "Ġmodule": 492,
      "alert": 493,
      "ĠĠĠĠĠĠ": 494,
      "ions": 495,
      "Ġif": 496,
      "cr": 497,
      "eg": 498,
      "ask": 499,
      "Ġ32": 500,
      "Ġad": 501,
      "gener": 502,
      "Ġcont": 503,
      "ide": 504,
      "Ġlc": 505,
      "Ġall": 506,
      "inv": 507,
      "one": 508,
      "39": 509,
      "amm": 510,
      "isc": 511,
      "ycle": 512,
      "ure": 513,
      "mode": 514,
      "py": 515,
      "Ġe": 516,
      "top": 517,
      "unctional": 518,
      "bit": 519,
      "iv": 520,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠ": 521,
      "Ġflash": 522,
      "valid": 523,
      "rol": 524,
      "ister": 525,
      "ME": 526,
      "ards": 527,
      "risc": 528,
      "ux": 529,
      "doc": 530,
      "lc": 531,
      "Ġotp": 532,
      "con": 533,
      "ost": 534,
      "ase": 535,
      "Ġwire": 536,
      "ile": 537,
      "ipher": 538,
      "sync": 539,
      "![": 540,
      "ĠL": 541,
      "Ġper": 542,
      "AS": 543,
      "tx": 544,
      "svg": 545,
      "ĠG": 546,
      "ument": 547,
      "ages": 548,
      "The": 549,
      "list": 550,
      "str": 551,
      "ocument": 552,
      "ĠClock": 553,
      "erface": 554,
      "IN": 555,
      "ran": 556,
      "ory": 557,
      "wrmgr": 558,
      "Ġ:": 559,
      "ardware": 560,
      "72": 561,
      "inject": 562,
      "Ġassign": 563,
      "Ġ<=": 564,
      "ges": 565,
      "Ġend": 566,
      "ype": 567,
      "ĠThis": 568,
      "////////////////": 569,
      "ue": 570,
      "ĠNum": 571,
      "amming": 572,
      "Ġrv": 573,
      "mux": 574,
      "Ġat": 575,
      "coded": 576,
      "macro": 577,
      "RE": 578,
      "Ġfrom": 579,
      "ant": 580,
      "util": 581,
      "lowrisc": 582,
      "Ġ**`": 583,
      "`**": 584,
      "hamming": 585,
      "ways": 586,
      "ashbo": 587,
      "can": 588,
      "Ġibex": 589,
      "Ġact": 590,
      "This": 591,
      "Ġ)": 592,
      "In": 593,
      "Ġdocument": 594,
      "![](": 595,
      "ter": 596,
      "ased": 597,
      "Ġcan": 598,
      "ize": 599,
      "ge": 600,
      "Ġass": 601,
      "ber": 602,
      "dashbo": 603,
      "pen": 604,
      "Ġfunctional": 605,
      "ĠčĊ": 606,
      "enc": 607,
      "dec": 608,
      "bad": 609,
      "Ġ$": 610,
      "Ġused": 611,
      "dashboards": 612,
      "badges": 613,
      "ER": 614,
      "cov": 615,
      "ĠIP": 616,
      "Ġalways": 617,
      "bind": 618,
      "Ġset": 619,
      "velop": 620,
      "ĠEnable": 621,
      "Alert": 622,
      "code": 623,
      "acl": 624,
      "fg": 625,
      "rit": 626,
      "Ġnot": 627,
      "Ġaes": 628,
      "Ġwh": 629,
      "Ġram": 630,
      ").": 631,
      "==": 632,
      "aon": 633,
      "fo": 634,
      "Ġrequ": 635,
      "buf": 636,
      "ew": 637,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 638,
      "ces": 639,
      "ord": 640,
      "Ġsim": 641,
      "Ġspecif": 642,
      "Ġtool": 643,
      "Ġbased": 644,
      "fa": 645,
      "ĠĠĠĠĠĠĠĠĠĠĠ": 646,
      "fig": 647,
      "log": 648,
      "--------------------------------": 649,
      "pro": 650,
      "tim": 651,
      "device": 652,
      "ance": 653,
      "De": 654,
      "ram": 655,
      "ug": 656,
      "Ġ4": 657,
      "Ġex": 658,
      "ator": 659,
      "ingle": 660,
      "Ġmubi": 661,
      "Ġi": 662,
      "Ġkey": 663,
      "Ġsh": 664,
      "ipheral": 665,
      "ax": 666,
      "inmux": 667,
      "Ġinterface": 668,
      "Alerts": 669,
      "22": 670,
      "ff": 671,
      "ĠDe": 672,
      "plement": 673,
      "src": 674,
      "ycles": 675,
      "Ġdif": 676,
      "ify": 677,
      "ies": 678,
      "Ġse": 679,
      "kew": 680,
      "Ġop": 681,
      "Ġ'": 682,
      "ĠU": 683,
      "Ġgener": 684,
      "ates": 685,
      "rr": 686,
      "ĠWidth": 687,
      "Ġinst": 688,
      "](../../": 689,
      "Titan": 690,
      "ĠVer": 691,
      "LK": 692,
      "pio": 693,
      "sp": 694,
      "penTitan": 695,
      "Ġpwrmgr": 696,
      "ary": 697,
      "epth": 698,
      "TH": 699,
      "Ġimplement": 700,
      "NumAlerts": 701,
      "Ġk": 702,
      "ASS": 703,
      "ID": 704,
      "wo": 705,
      "Ġtop": 706,
      "entitan": 707,
      "uffer": 708,
      "On": 709,
      "Ġch": 710,
      "ĠInterfaces": 711,
      "rror": 712,
      "ST": 713,
      "uto": 714,
      "Ġso": 715,
      "Ġdevice": 716,
      "ben": 717,
      "Ġinit": 718,
      "bench": 719,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 720,
      "Ġdiffer": 721,
      "):": 722,
      "opentitan": 723,
      "Error": 724,
      "Ġrstmgr": 725,
      "ĠAlert": 726,
      "Ġtestbench": 727,
      "READ": 728,
      "rv": 729,
      "ulation": 730,
      "01": 731,
      "Ad": 732,
      "ay": 733,
      "ual": 734,
      "ine": 735,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 736,
      "ame": 737,
      "];": 738,
      "Ġbuffer": 739,
      "ropy": 740,
      "Ġregister": 741,
      "UL": 742,
      "ĠQ": 743,
      "edn": 744,
      "gram": 745,
      "rans": 746,
      "README": 747,
      "Ġhas": 748,
      "Ġdifferent": 749,
      "vm": 750,
      "orm": 751,
      "Ġfunctionality": 752,
      "EN": 753,
      "velopment": 754,
      "Type": 755,
      "ther": 756,
      "ave": 757,
      "Ġle": 758,
      "Ġ39": 759,
      "Ġenable": 760,
      "Ġcontrol": 761,
      "Ġac": 762,
      "esc": 763,
      "Ġperipheral": 764,
      "rite": 765,
      "16": 766,
      "ft": 767,
      "Ġor": 768,
      "Ġrun": 769,
      "error": 770,
      "addr": 771,
      "omain": 772,
      "ĠHW": 773,
      "uch": 774,
      "Ġ64": 775,
      "Ġmult": 776,
      "ĠVerify": 777,
      "Addr": 778,
      "ron": 779,
      "ĠOpenTitan": 780,
      "Ġassert": 781,
      "Ġ{": 782,
      "Ġtrans": 783,
      "ill": 784,
      "Ġ22": 785,
      "Ġfol": 786,
      "errup": 787,
      "IDTH": 788,
      "errupt": 789,
      "PV": 790,
      "ast": 791,
      "pd": 792,
      "uide": 793,
      "Ġv": 794,
      "ical": 795,
      "Ġ->": 796,
      "Ġadd": 797,
      "Ġ--": 798,
      "edge": 799,
      "Ġfollow": 800,
      "egr": 801,
      "count": 802,
      "vel": 803,
      "ower": 804,
      "PI": 805,
      "Ġval": 806,
      "Ġconfig": 807,
      "andler": 808,
      "ell": 809,
      "28": 810,
      "main": 811,
      "te": 812,
      "Ġver": 813,
      "syncOn": 814,
      "csr": 815,
      "Ġtim": 816,
      "Ġonly": 817,
      "view": 818,
      "55": 819,
      "63": 820,
      "tion": 821,
      "Ġspi": 822,
      "En": 823,
      "ĠNumber": 824,
      "76": 825,
      "ok": 826,
      "stem": 827,
      "Ġsignals": 828,
      "`](": 829,
      "ust": 830,
      "ures": 831,
      "Ġ8": 832,
      "ĠRe": 833,
      "ĠBus": 834,
      "38": 835,
      "Reg": 836,
      "Ġinto": 837,
      "ĠRes": 838,
      "fault": 839,
      "MP": 840,
      "def": 841,
      "Ġmem": 842,
      "verview": 843,
      "here": 844,
      "macros": 845,
      "Ġrequest": 846,
      "cess": 847,
      "eat": 848,
      "handler": 849,
      "ng": 850,
      "Ġreq": 851,
      "svh": 852,
      "Ġactive": 853,
      "ERT": 854,
      "ak": 855,
      "ll": 856,
      "report": 857,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 858,
      "](../../../../": 859,
      "AT": 860,
      "TR": 861,
      "WIDTH": 862,
      "pon": 863,
      "tag": 864,
      "Ġpinmux": 865,
      "Ġscan": 866,
      "Ġclkmgr": 867,
      "ĠSt": 868,
      "Ġhardware": 869,
      "ftware": 870,
      "ia": 871,
      "Ġ@": 872,
      "Ġtwo": 873,
      "rent": 874,
      "plan": 875,
      "ress": 876,
      "TL": 877,
      "jtag": 878,
      "}}": 879,
      "ifo": 880,
      "anti": 881,
      "Ġ72": 882,
      "Ġinterfaces": 883,
      "Ġerrors": 884,
      "99": 885,
      "ended": 886,
      "Ġinstanti": 887,
      "rx": 888,
      "ĠCLK": 889,
      "!--": 890,
      "56": 891,
      "IS": 892,
      "LE": 893,
      "encoded": 894,
      "Ġblock": 895,
      "<!--": 896,
      "cfg": 897,
      "red": 898,
      "ence": 899,
      "Ġwe": 900,
      "chron": 901,
      "pecification": 902,
      "AM": 903,
      "uld": 904,
      "Ġmask": 905,
      "ĠSec": 906,
      "ĠRV": 907,
      "Ġstate": 908,
      "iagram": 909,
      "-|": 910,
      "IF": 911,
      "go": 912,
      "ir": 913,
      "itions": 914,
      "Ġcore": 915,
      "ibut": 916,
      "Ġchecklist": 917,
      "(\"": 918,
      "lat": 919,
      "ink": 920,
      "ĠCon": 921,
      "Ġcomm": 922,
      "pos": 923,
      "ever": 924,
      "ree": 925,
      "Ġdo": 926,
      "entropy": 927,
      "Ġsyn": 928,
      "Ġfollowing": 929,
      "get": 930,
      "sm": 931,
      "Ġdomain": 932,
      "SR": 933,
      "host": 934,
      "son": 935,
      "col": 936,
      "ĠSV": 937,
      "ĠDes": 938,
      "00000000": 939,
      "point": 940,
      "testplan": 941,
      "Ġdifferential": 942,
      "21": 943,
      "End": 944,
      "Val": 945,
      "[`": 946,
      "bg": 947,
      "bug": 948,
      "nst": 949,
      "atus": 950,
      "ech": 951,
      "ĠDV": 952,
      "Ġdet": 953,
      "ĠOverview": 954,
      "hecklist": 955,
      "timer": 956,
      "'t": 957,
      "Data": 958,
      "][": 959,
      "eed": 960,
      "Ġrefer": 961,
      "Ġbelow": 962,
      "ĠTo": 963,
      "ĠOT": 964,
      "plic": 965,
      "tribut": 966,
      "Ġsimulation": 967,
      "project": 968,
      "ES": 969,
      "json": 970,
      "ould": 971,
      "Ġpack": 972,
      "ich": 973,
      "Ġwill": 974,
      "Ġone": 975,
      "tbn": 976,
      "\")": 977,
      "20": 978,
      "71": 979,
      "Ġencoded": 980,
      "upport": 981,
      "eatures": 982,
      "dm": 983,
      "slow": 984,
      "Ġdep": 985,
      "tocol": 986,
      "CC": 987,
      "FPV": 988,
      "Ġinterrupt": 989,
      "ĠReset": 990,
      "Endpoint": 991,
      "fsr": 992,
      "Ġgen": 993,
      "Ġauto": 994,
      "arget": 995,
      "Ġotbn": 996,
      "Ġman": 997,
      "Ġhave": 998,
      "sel": 999,
      "vern": 1000,
      "ection": 1001,
      "egrity": 1002,
      "AsyncOn": 1003,
      "OR": 1004,
      "do": 1005,
      "yndrome": 1006,
      "Ġcell": 1007,
      "isable": 1008,
      "Ġuse": 1009,
      "Ġwhich": 1010,
      "ASSERT": 1011,
      "govern": 1012,
      "DR": 1013,
      "hjson": 1014,
      "sh": 1015,
      "tool": 1016,
      "EndpointType": 1017,
      "03": 1018,
      "state": 1019,
      "adow": 1020,
      "ility": 1021,
      "Ġcount": 1022,
      "vior": 1023,
      "ADR": 1024,
      "ĠWE": 1025,
      "havior": 1026,
      "generated": 1027,
      "TA": 1028,
      "ping": 1029,
      "trol": 1030,
      "Ġmo": 1031,
      "Ġcycles": 1032,
      "ition": 1033,
      "Ġfi": 1034,
      "FFF": 1035,
      "peration": 1036,
      "Ġvalue": 1037,
      "Ġmemory": 1038,
      "Depth": 1039,
      "clog": 1040,
      "sc": 1041,
      "Ġedn": 1042,
      "Ġtb": 1043,
      "Ġtr": 1044,
      "als": 1045,
      "igh": 1046,
      "ĠReg": 1047,
      "Ġstage": 1048,
      "Ġits": 1049,
      "Ġguide": 1050,
      "====": 1051,
      "Device": 1052,
      "MA": 1053,
      "UM": 1054,
      "form": 1055,
      "und": 1056,
      "Ġread": 1057,
      "ĠRead": 1058,
      "ail": 1059,
      "ied": 1060,
      "iver": 1061,
      "Ġ==": 1062,
      "Ġflop": 1063,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1064,
      "Ġwr": 1065,
      "Ġform": 1066,
      "Ġdef": 1067,
      "comb": 1068,
      "33": 1069,
      "RV": 1070,
      "Ġmode": 1071,
      "Ġutil": 1072,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1073,
      "ulse": 1074,
      "ĠIt": 1075,
      "ĠWrite": 1076,
      "Ġwhen": 1077,
      "pg": 1078,
      "pwr": 1079,
      "ones": 1080,
      "Ġsec": 1081,
      "Ġsuch": 1082,
      "Ġthem": 1083,
      "ification": 1084,
      "portable": 1085,
      "------------": 1086,
      "Ġcode": 1087,
      "ender": 1088,
      "urrent": 1089,
      "Ġprotocol": 1090,
      "Ġinitial": 1091,
      "DW": 1092,
      "RAM": 1093,
      "dc": 1094,
      "logic": 1095,
      "encode": 1096,
      "Ġcio": 1097,
      "Ġwhere": 1098,
      "reggen": 1099,
      "Ġ^((": 1100,
      "Ġsoftware": 1101,
      "Ġtransitions": 1102,
      "governance": 1103,
      "Otp": 1104,
      "VM": 1105,
      "ss": 1106,
      "Ġbo": 1107,
      "Ġfeatures": 1108,
      "ĠSRAM": 1109,
      "ĠRnd": 1110,
      "Ġhw": 1111,
      "apper": 1112,
      "}},": 1113,
      "AA": 1114,
      "GEN": 1115,
      "Max": 1116,
      "bx": 1117,
      "Ġdu": 1118,
      "Ġping": 1119,
      "arl": 1120,
      "ank": 1121,
      "Ġinter": 1122,
      "Ġ16": 1123,
      "ĠSpecification": 1124,
      "ĠOut": 1125,
      "own": 1126,
      "Ġkeymgr": 1127,
      "Ġshould": 1128,
      "Ke": 1129,
      "Mask": 1130,
      "OM": 1131,
      "Size": 1132,
      "we": 1133,
      "ined": 1134,
      "all": 1135,
      "Ġ./": 1136,
      "Ġparameters": 1137,
      "ach": 1138,
      "ĠIf": 1139,
      "ability": 1140,
      "ceiver": 1141,
      "pli": 1142,
      "Ġ@(": 1143,
      "chroniz": 1144,
      "Bi": 1145,
      "Det": 1146,
      "Re": 1147,
      "Single": 1148,
      "])": 1149,
      "ee": 1150,
      "ger": 1151,
      "pass": 1152,
      "rd": 1153,
      "su": 1154,
      "sys": 1155,
      "uBi": 1156,
      "Ġq": 1157,
      "ents": 1158,
      "regtool": 1159,
      "Ġhand": 1160,
      "Ġhigh": 1161,
      "emp": 1162,
      "uration": 1163,
      "ErrorDet": 1164,
      "countones": 1165,
      "IFO": 1166,
      "SingleErrorDet": 1167,
      "EG": 1168,
      "mem": 1169,
      "hes": 1170,
      "arity": 1171,
      "](../": 1172,
      "Ġtests": 1173,
      "Ġ-->": 1174,
      "adowed": 1175,
      "Cnst": 1176,
      "St": 1177,
      "act": 1178,
      "otp": 1179,
      "Ġentropy": 1180,
      "Ġinclude": 1181,
      "Ġsupport": 1182,
      "escal": 1183,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1184,
      "ull": 1185,
      "ĠTest": 1186,
      "NumReg": 1187,
      "else": 1188,
      "ĠBEG": 1189,
      "Ġgpio": 1190,
      "Ġtime": 1191,
      "ISC": 1192,
      "echn": 1193,
      "TAG": 1194,
      "ĠBEGIN": 1195,
      "12": 1196,
      "DGEN": 1197,
      "MDGEN": 1198,
      "fsm": 1199,
      "line": 1200,
      "so": 1201,
      "start": 1202,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1203,
      "Ġmust": 1204,
      "ĠSo": 1205,
      "umber": 1206,
      "ĠCMDGEN": 1207,
      "Ġstart": 1208,
      "irect": 1209,
      "bits": 1210,
      "posedge": 1211,
      "Com": 1212,
      "NUM": 1213,
      "ning": 1214,
      "racl": 1215,
      "use": 1216,
      "Ġve": 1217,
      "Ġvalid": 1218,
      "rey": 1219,
      "Ġsame": 1220,
      "Ġuvm": 1221,
      "Ġcover": 1222,
      "Ġnumber": 1223,
      "ĠDevice": 1224,
      "24": 1225,
      "Cycles": 1226,
      "SB": 1227,
      "Ġ/": 1228,
      "Ġid": 1229,
      "Ġskew": 1230,
      "igger": 1231,
      "ĠIO": 1232,
      "ĠPrim": 1233,
      "stru": 1234,
      "Ġactual": 1235,
      "ugh": 1236,
      "Key": 1237,
      "15": 1238,
      "Per": 1239,
      "],": 1240,
      "ĠDepth": 1241,
      "ild": 1242,
      "Ġcontain": 1243,
      "'(": 1244,
      "Bus": 1245,
      "IO": 1246,
      "OT": 1247,
      "lect": 1248,
      "Ġfile": 1249,
      "ĠPMP": 1250,
      "Ġcons": 1251,
      "Ġsys": 1252,
      "ĠMem": 1253,
      "Ġusb": 1254,
      "Ġregisters": 1255,
      "dbg": 1256,
      "ous": 1257,
      "Ġelse": 1258,
      "ins": 1259,
      "Ġdm": 1260,
      "Ġdone": 1261,
      "Ġbehavior": 1262,
      "olic": 1263,
      "ote": 1264,
      "urce": 1265,
      "ĠFIFO": 1266,
      "crip": 1267,
      "////////////////////////////////": 1268,
      "pliance": 1269,
      "SingleErrorDetect": 1270,
      "'s": 1271,
      "57": 1272,
      "Buf": 1273,
      "done": 1274,
      "none": 1275,
      "sing": 1276,
      "sha": 1277,
      "Ġack": 1278,
      "Ġpad": 1279,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1280,
      "ecc": 1281,
      "ĠHardware": 1282,
      "isters": 1283,
      "ĠAlertAsyncOn": 1284,
      "Ġaddress": 1285,
      "tributing": 1286,
      "Ġguideline": 1287,
      "ĠRndCnst": 1288,
      "Ġincludes": 1289,
      "68": 1290,
      "BN": 1291,
      "Int": 1292,
      "specif": 1293,
      "Ġcl": 1294,
      "Ġsp": 1295,
      "Ġslow": 1296,
      "acro": 1297,
      "Ġdesign": 1298,
      "contributing": 1299,
      "Ġimplementation": 1300,
      "Ġcommand": 1301,
      "Ġsynchroniz": 1302,
      "echnical": 1303,
      "DV": 1304,
      "IC": 1305,
      "mp": 1306,
      "ms": 1307,
      "ndef": 1308,
      "set": 1309,
      "ystem": 1310,
      "Ġx": 1311,
      "Ġsha": 1312,
      "Ġ(.": 1313,
      "ifndef": 1314,
      "ĠROM": 1315,
      "ired": 1316,
      "axim": 1317,
      "kewCycles": 1318,
      "Ġverification": 1319,
      "specific": 1320,
      "All": 1321,
      "clock": 1322,
      "gpio": 1323,
      "pwrmgr": 1324,
      "|:": 1325,
      "read": 1326,
      "Ġover": 1327,
      "Ġwidth": 1328,
      "ĠData": 1329,
      "Ġ28": 1330,
      "comm": 1331,
      "Ġadc": 1332,
      "Ġimplements": 1333,
      "Comportable": 1334,
      "Ġcoverage": 1335,
      "CO": 1336,
      "Dw": 1337,
      "fi": 1338,
      "mask": 1339,
      "Ġar": 1340,
      "Ġpa": 1341,
      "Ġpat": 1342,
      "Ġsub": 1343,
      "Ġbus": 1344,
      "amb": 1345,
      "ases": 1346,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1347,
      "Ġrom": 1348,
      "Ġword": 1349,
      "portability": 1350,
      "Ġno": 1351,
      "Ġstr": 1352,
      "Ġ#(.": 1353,
      "ypes": 1354,
      "lerated": 1355,
      "cramb": 1356,
      "utils": 1357,
      "Ġtools": 1358,
      "Ġdefined": 1359,
      "olicy": 1360,
      "grey": 1361,
      "ml": 1362,
      "yte": 1363,
      "ĠX": 1364,
      "ating": 1365,
      "Ġcycle": 1366,
      "Ġdv": 1367,
      "rough": 1368,
      "Ġintr": 1369,
      "Ġtolerated": 1370,
      "Ġupd": 1371,
      "ĠTechnical": 1372,
      "ĠDW": 1373,
      "ilter": 1374,
      "Ġbits": 1375,
      "Ġstatus": 1376,
      "ĠHost": 1377,
      "Ġkmac": 1378,
      "Ġlevel": 1379,
      "ĠControl": 1380,
      "arlgrey": 1381,
      "no": 1382,
      "env": 1383,
      "seed": 1384,
      "book": 1385,
      "reports": 1386,
      "Ġformal": 1387,
      "ake": 1388,
      "fifo": 1389,
      "kup": 1390,
      "pad": 1391,
      "eng": 1392,
      "itive": 1393,
      "Ġdyn": 1394,
      "Ġdec": 1395,
      "ext": 1396,
      "intr": 1397,
      "Ġspecified": 1398,
      "rxtx": 1399,
      "Ġpackages": 1400,
      "Ġcells": 1401,
      "aximum": 1402,
      "Ġdynam": 1403,
      "))": 1404,
      "));": 1405,
      "DE": 1406,
      "Link": 1407,
      "SkewCycles": 1408,
      "check": 1409,
      "hy": 1410,
      "Ġreceiver": 1411,
      "Ġmain": 1412,
      "ĠChecklist": 1413,
      "html": 1414,
      "Ġcompliance": 1415,
      "comportability": 1416,
      "Ġprovi": 1417,
      "pok": 1418,
      "ileLink": 1419,
      "ĠAlertSkewCycles": 1420,
      "Ġinstantiates": 1421,
      "struction": 1422,
      "ready": 1423,
      "Ġdynamic": 1424,
      "++": 1425,
      "11": 1426,
      "Cnt": 1427,
      "ode": 1428,
      "ĠJ": 1429,
      "Ġpart": 1430,
      "Ġcip": 1431,
      "Ġmacro": 1432,
      "###": 1433,
      "owever": 1434,
      "Ġcontains": 1435,
      "eas": 1436,
      "development": 1437,
      "Ġup": 1438,
      "ache": 1439,
      "ĠTileLink": 1440,
      "ĠPad": 1441,
      "Ġev": 1442,
      "Ġscanmode": 1443,
      "NG": 1444,
      "aw": 1445,
      "auto": 1446,
      "ding": 1447,
      "oals": 1448,
      "uvm": 1449,
      "Ġast": 1450,
      "Ġcase": 1451,
      "Ġcases": 1452,
      "Ġspec": 1453,
      "ĠRacl": 1454,
      "ager": 1455,
      "](#": 1456,
      "ibit": 1457,
      "Ġlsu": 1458,
      "ĠClocks": 1459,
      "Ġmultibit": 1460,
      "pga": 1461,
      "AC": 1462,
      "bex": 1463,
      "cnt": 1464,
      "Ġport": 1465,
      "dev": 1466,
      "Ġsender": 1467,
      "modules": 1468,
      "ĠCom": 1469,
      "ĠPro": 1470,
      "ĠOn": 1471,
      "Ġsystem": 1472,
      "ĠGoals": 1473,
      "Ġspecifies": 1474,
      "Ġconfiguration": 1475,
      "latest": 1476,
      "cription": 1477,
      "autogen": 1478,
      "\",": 1479,
      "IP": 1480,
      "flop": 1481,
      "functional": 1482,
      "pr": 1483,
      "xx": 1484,
      "Ġ76": 1485,
      "Ġjtag": 1486,
      "stages": 1487,
      "Ġ[`": 1488,
      "Ġdisable": 1489,
      "Ġro": 1490,
      "ĠTL": 1491,
      "umm": 1492,
      "nthes": 1493,
      "ĠIntegrity": 1494,
      "Ġeach": 1495,
      "Ġsequ": 1496,
      "Ġrunning": 1497,
      "Ġcounter": 1498,
      "Id": 1499,
      "nal": 1500,
      "syndrome": 1501,
      "ution": 1502,
      "ick": 1503,
      "Ġcsr": 1504,
      "Ġcipher": 1505,
      "Ġbet": 1506,
      "Ġdes": 1507,
      "Ġdevelopment": 1508,
      "rstmgr": 1509,
      "Ġsynthes": 1510,
      "ĠBlock": 1511,
      "ization": 1512,
      "cryp": 1513,
      "AddrWidth": 1514,
      "Ġdetection": 1515,
      "Ġsimulations": 1516,
      "Ġflops": 1517,
      "ween": 1518,
      "Ġbetween": 1519,
      "07": 1520,
      "Co": 1521,
      "HW": 1522,
      "Rsp": 1523,
      "TS": 1524,
      "earlgrey": 1525,
      "je": 1526,
      "rc": 1527,
      "side": 1528,
      "ens": 1529,
      "led": 1530,
      "Ġclo": 1531,
      "Ġfunction": 1532,
      "Ġwrite": 1533,
      "Ġrepl": 1534,
      "aced": 1535,
      "Ġstages": 1536,
      "Ġuser": 1537,
      "interfaces": 1538,
      "Ġcontroller": 1539,
      "ĠSVA": 1540,
      "ĠOTP": 1541,
      "ĠPrimary": 1542,
      "|:--------------------------------": 1543,
      "02": 1544,
      "AL": 1545,
      "CE": 1546,
      "CLK": 1547,
      "ED": 1548,
      "din": 1549,
      "rsp": 1550,
      "Ġinout": 1551,
      "Ġdirect": 1552,
      "ĠCurrent": 1553,
      "ĠOther": 1554,
      "Ġany": 1555,
      "Ġchip": 1556,
      "ĠDescription": 1557,
      "pe": 1558,
      "wards": 1559,
      "Ġ3": 1560,
      "ere": 1561,
      "Ġpower": 1562,
      "Ġsw": 1563,
      "ample": 1564,
      "Ġrecomm": 1565,
      "ĠRISC": 1566,
      "urity": 1567,
      "eld": 1568,
      "wrapper": 1569,
      "fore": 1570,
      "TRL": 1571,
      "shadowed": 1572,
      "passing": 1573,
      "Ġspecial": 1574,
      "36": 1575,
      "SM": 1576,
      "UVM": 1577,
      "ause": 1578,
      "ferr": 1579,
      "Ġ#": 1580,
      "Ġvi": 1581,
      "input": 1582,
      "eriv": 1583,
      "Ġser": 1584,
      "ctor": 1585,
      "ĠSingle": 1586,
      "assign": 1587,
      "Ġthrough": 1588,
      "ĠOperation": 1589,
      "ibr": 1590,
      "sram": 1591,
      "Ġrespon": 1592,
      "ĠTheory": 1593,
      "ĠIntended": 1594,
      "ATE": 1595,
      "Value": 1596,
      "Referr": 1597,
      "Ġreplaced": 1598,
      "Referring": 1599,
      "Des": 1600,
      "Sec": 1601,
      "cm": 1602,
      "ored": 1603,
      "sw": 1604,
      "Ġ7": 1605,
      "Ġ;": 1606,
      "lear": 1607,
      "lease": 1608,
      "Ġintg": 1609,
      "ĠSystem": 1610,
      "Ġhost": 1611,
      "ĠAES": 1612,
      "sva": 1613,
      "Ġaddr": 1614,
      "Ġrequired": 1615,
      "Default": 1616,
      "PIO": 1617,
      "Enable": 1618,
      "ĠDesign": 1619,
      "ĠOutput": 1620,
      "Masking": 1621,
      "Ġsysrst": 1622,
      "Ġsynthesis": 1623,
      "Design": 1624,
      "for": 1625,
      "var": 1626,
      "Ġ+": 1627,
      "Ġio": 1628,
      "Ġescal": 1629,
      "ero": 1630,
      "Ġcal": 1631,
      "async": 1632,
      "ane": 1633,
      "Ġdon": 1634,
      "Ġtowards": 1635,
      "ĠDiagram": 1636,
      "chk": 1637,
      "Ġconst": 1638,
      "andom": 1639,
      "ĠHowever": 1640,
      "Ġregion": 1641,
      "ĠNote": 1642,
      "ĠDevelop": 1643,
      "Ġgenerated": 1644,
      "Ġassertions": 1645,
      "Ġdoes": 1646,
      "Ġtrigger": 1647,
      "Ġclosing": 1648,
      "Ġrecommended": 1649,
      "EL": 1650,
      "File": 1651,
      "byp": 1652,
      "cmd": 1653,
      "type": 1654,
      "uild": 1655,
      "âĶ": 1656,
      "Ġ?": 1657,
      "ĠK": 1658,
      "Ġpo": 1659,
      "level": 1660,
      "ĠSPI": 1661,
      "ĠCh": 1662,
      "clkmgr": 1663,
      "Ġusing": 1664,
      "Ġitem": 1665,
      "Ġchecks": 1666,
      "Init": 1667,
      "Ġchan": 1668,
      "Ġmultip": 1669,
      "](../../../../../": 1670,
      "ĠStage": 1671,
      "eccak": 1672,
      "Ġescalation": 1673,
      "19": 1674,
      "67": 1675,
      "CTRL": 1676,
      "LIC": 1677,
      "PR": 1678,
      "Pad": 1679,
      "WE": 1680,
      "``": 1681,
      "bar": 1682,
      "di": 1683,
      "div": 1684,
      "spi": 1685,
      "tgen": 1686,
      "Ġ,": 1687,
      "---": 1688,
      "Ġinputs": 1689,
      "ict": 1690,
      "Ġdr": 1691,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1692,
      "Ġmaximum": 1693,
      "Ġdefault": 1694,
      "ĠAST": 1695,
      "ĠADR": 1696,
      "usb": 1697,
      "ĠMan": 1698,
      "Ġcomp": 1699,
      "ĠInterface": 1700,
      "ĠVLE": 1701,
      "Ġvar": 1702,
      "eeded": 1703,
      "FC": 1704,
      "It": 1705,
      "Lfsr": 1706,
      "MuBi": 1707,
      "ON": 1708,
      "PLIC": 1709,
      "Sel": 1710,
      "flash": 1711,
      "pinmux": 1712,
      "rash": 1713,
      "wm": 1714,
      "ĠĠčĊ": 1715,
      "Ġlow": 1716,
      "ess": 1717,
      "Ġrd": 1718,
      "Ġcopi": 1719,
      "ĠPR": 1720,
      "Ġnew": 1721,
      "Ġconstr": 1722,
      "Ġwithin": 1723,
      "intg": 1724,
      "box": 1725,
      "MEM": 1726,
      "Ġinterrupts": 1727,
      "MAX": 1728,
      "ously": 1729,
      "ĠJTAG": 1730,
      "erived": 1731,
      "Ġconstrain": 1732,
      "13": 1733,
      "48": 1734,
      "Byte": 1735,
      "ECC": 1736,
      "action": 1737,
      "part": 1738,
      "scan": 1739,
      "ination": 1740,
      "stage": 1741,
      "Ġav": 1742,
      "Ġaon": 1743,
      "arje": 1744,
      "ntropy": 1745,
      "Ġdebug": 1746,
      "Ġneed": 1747,
      "empl": 1748,
      "ives": 1749,
      "INT": 1750,
      "order": 1751,
      "Ġmodel": 1752,
      "ength": 1753,
      "pgaBuf": 1754,
      "Ġitems": 1755,
      "arjeel": 1756,
      "(.": 1757,
      "10": 1758,
      "78": 1759,
      "Check": 1760,
      "DC": 1761,
      "oF": 1762,
      "pt": 1763,
      "pulse": 1764,
      "sg": 1765,
      "Ġtarget": 1766,
      "Ġtempl": 1767,
      "Ġsm": 1768,
      "ight": 1769,
      "Ġwrit": 1770,
      "ĠIbex": 1771,
      "Ġnon": 1772,
      "Ġneeded": 1773,
      "biter": 1774,
      "Ġassum": 1775,
      "Ġspecification": 1776,
      "Ġleave": 1777,
      "DataWidth": 1778,
      "========": 1779,
      "Intg": 1780,
      "Ġsynchronizer": 1781,
      "Ġcalc": 1782,
      "Ġconstraint": 1783,
      "arjeeling": 1784,
      "->": 1785,
      "Hardware": 1786,
      "Out": 1787,
      "PG": 1788,
      "Two": 1789,
      "UP": 1790,
      "hen": 1791,
      "ling": 1792,
      "ox": 1793,
      "reator": 1794,
      "Ġpass": 1795,
      "Ġoperation": 1796,
      "Ġsingle": 1797,
      "Ġbefore": 1798,
      "regs": 1799,
      "Ġalso": 1800,
      "ilator": 1801,
      "Ġcoll": 1802,
      "Ġ|->": 1803,
      "Ġacc": 1804,
      "Ġaddition": 1805,
      "Ġmanager": 1806,
      "Ġvector": 1807,
      "Ġconsist": 1808,
      "Ġconstant": 1809,
      "UME": 1810,
      "lay": 1811,
      "nect": 1812,
      "ri": 1813,
      "sion": 1814,
      "uart": 1815,
      "Ġy": 1816,
      "Ġinv": 1817,
      "ret": 1818,
      "ream": 1819,
      "load": 1820,
      "debug": 1821,
      "Ġdiagram": 1822,
      "Ġtouch": 1823,
      "igest": 1824,
      "Ġwon": 1825,
      "ĠIC": 1826,
      "ĠSyndrome": 1827,
      "ĠCSR": 1828,
      "genvar": 1829,
      "ĠFSM": 1830,
      "ultane": 1831,
      "apse": 1832,
      "ĠInject": 1833,
      "ERR": 1834,
      "Ġsimultane": 1835,
      "ĠUSB": 1836,
      "ASSUME": 1837,
      "Errors": 1838,
      "Ġconfigure": 1839,
      "MaxTwo": 1840,
      "Ġsupports": 1841,
      "NumRegs": 1842,
      "Ġpair": 1843,
      "Ġprovide": 1844,
      "Ġsequence": 1845,
      "Idx": 1846,
      "cryption": 1847,
      "Ġcalculation": 1848,
      "Ġcollapse": 1849,
      "Ġsimultaneously": 1850,
      "MaxTwoErrors": 1851,
      "Aw": 1852,
      "fter": 1853,
      "mbx": 1854,
      "osc": 1855,
      "pp": 1856,
      "phy": 1857,
      "ues": 1858,
      "ork": 1859,
      "only": 1860,
      "Ġoper": 1861,
      "Ġintegrity": 1862,
      "registers": 1863,
      "endif": 1864,
      "Ġstep": 1865,
      "old": 1866,
      "trig": 1867,
      "ĠInput": 1868,
      "peri": 1869,
      "Ġaccess": 1870,
      "Ġvalues": 1871,
      "ĠOTBN": 1872,
      "Count": 1873,
      "75": 1874,
      "CD": 1875,
      "Cfg": 1876,
      "Racl": 1877,
      "Tr": 1878,
      "VEL": 1879,
      "]^": 1880,
      "down": 1881,
      "gle": 1882,
      "gith": 1883,
      "sim": 1884,
      "ting": 1885,
      "Ġ5": 1886,
      "Ġesc": 1887,
      "info": 1888,
      "Ġinfo": 1889,
      "enable": 1890,
      "ite": 1891,
      "Ġsep": 1892,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1893,
      "ross": 1894,
      "Ġuart": 1895,
      "gramm": 1896,
      "ĠPer": 1897,
      "ĠEntropy": 1898,
      "ĠFor": 1899,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1900,
      "ADDR": 1901,
      "crib": 1902,
      "ĠEnableRacl": 1903,
      "Ġexec": 1904,
      "9999": 1905,
      "LEVEL": 1906,
      "NumRegions": 1907,
      "cramble": 1908,
      "Ġcsrng": 1909,
      "ĠChip": 1910,
      "InitFile": 1911,
      "github": 1912,
      "Ġsepar": 1913,
      "*);": 1914,
      "25": 1915,
      "Bank": 1916,
      "FSR": 1917,
      "OP": 1918,
      "Power": 1919,
      "Sram": 1920,
      "ryp": 1921,
      "ved": 1922,
      "instr": 1923,
      "Ġph": 1924,
      "Ġpulse": 1925,
      "ally": 1926,
      "---------|": 1927,
      "Ġ128": 1928,
      "ĠCo": 1929,
      "ĠAd": 1930,
      "chor": 1931,
      "Ġresult": 1932,
      "ĠFPV": 1933,
      "Ġcomb": 1934,
      "output": 1935,
      "riscv": 1936,
      "ency": 1937,
      "time": 1938,
      "ffset": 1939,
      "Ġoptim": 1940,
      "ĠResetValue": 1941,
      "Ġboth": 1942,
      "ummary": 1943,
      "GR": 1944,
      "HA": 1945,
      "IZ": 1946,
      "Im": 1947,
      "MGR": 1948,
      "PMP": 1949,
      "Seed": 1950,
      "darjeeling": 1951,
      "not": 1952,
      "nel": 1953,
      "sPer": 1954,
      "init": 1955,
      "Ġfilter": 1956,
      "ans": 1957,
      "Ġderived": 1958,
      "Ġmbx": 1959,
      "Ġbeen": 1960,
      "arden": 1961,
      "ĠED": 1962,
      "ĠMuBi": 1963,
      "Ġprocess": 1964,
      "keymgr": 1965,
      "Ġcontent": 1966,
      "`**,": 1967,
      "ĠHWIP": 1968,
      "5555": 1969,
      "ails": 1970,
      "++)": 1971,
      "366": 1972,
      "Ġvia": 1973,
      "ĠPeripheral": 1974,
      "Impl": 1975,
      "27": 1976,
      "TB": 1977,
      "dpe": 1978,
      "ggle": 1979,
      "mm": 1980,
      "win": 1981,
      "Ġ),": 1982,
      "erase": 1983,
      "Ġinform": 1984,
      "Ġag": 1985,
      "icon": 1986,
      "Ġother": 1987,
      "Ġsoc": 1988,
      "Ġfree": 1989,
      "idle": 1990,
      "adc": 1991,
      "ilicon": 1992,
      "ĠAsyncOn": 1993,
      "ible": 1994,
      "ASH": 1995,
      "Info": 1996,
      "fail": 1997,
      "Ġselect": 1998,
      "Ġgeneric": 1999,
      "](../../../": 2000,
      "ically": 2001,
      "Ġfirst": 2002,
      "Ġveer": 2003,
      "ĠController": 2004,
      "INTERR": 2005,
      "PGA": 2006,
      "IZE": 2007,
      "Target": 2008,
      "block": 2009,
      "da": 2010,
      "hot": 2011,
      "pres": 2012,
      "verr": 2013,
      "Ġorder": 2014,
      "Ġinstruction": 2015,
      "Ġtype": 2016,
      "Ġclear": 2017,
      "arbiter": 2018,
      "Ġside": 2019,
      "Ġsram": 2020,
      "etch": 2021,
      "Ġdout": 2022,
      "Ġmeas": 2023,
      "ĠSummary": 2024,
      "Ġallow": 2025,
      "Ġthere": 2026,
      "Ġascon": 2027,
      "ĠAW": 2028,
      "ĠAON": 2029,
      "reset": 2030,
      "ĠMode": 2031,
      "ĠVMEM": 2032,
      "Ġresets": 2033,
      "ĠGuide": 2034,
      "logy": 2035,
      "Ġsource": 2036,
      "Ġassertion": 2037,
      "Ġsecurity": 2038,
      "Ġinternal": 2039,
      "BusAddr": 2040,
      "shake": 2041,
      "Ġxbar": 2042,
      "Ġupdated": 2043,
      "ensor": 2044,
      "Ġtemplate": 2045,
      "oxImpl": 2046,
      "Ġseparate": 2047,
      "INTERRUP": 2048,
      "08": 2049,
      "Bit": 2050,
      "BTB": 2051,
      "If": 2052,
      "Ro": 2053,
      "Str": 2054,
      "dif": 2055,
      "pect": 2056,
      "types": 2057,
      "Ġic": 2058,
      "lob": 2059,
      "Ġplease": 2060,
      "atch": 2061,
      "ctl": 2062,
      "Ġdin": 2063,
      "ife": 2064,
      "ift": 2065,
      "ularity": 2066,
      "ace": 2067,
      "Ġmake": 2068,
      "ĠId": 2069,
      "Ġcomple": 2070,
      "ĠUVM": 2071,
      "ErrorRsp": 2072,
      "Ġasserted": 2073,
      "Ġwords": 2074,
      "Ġstring": 2075,
      "Ġround": 2076,
      "Ġdescrib": 2077,
      "Ġresponse": 2078,
      "Ġadditional": 2079,
      "INTERRUPTS": 2080,
      ".](../": 2081,
      "LO": 2082,
      "OU": 2083,
      "PM": 2084,
      "av": 2085,
      "ner": 2086,
      "oot": 2087,
      "sb": 2088,
      "soc": 2089,
      "ince": 2090,
      "Ġpre": 2091,
      "Ġcfg": 2092,
      "Ġfifo": 2093,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 2094,
      "Ġrsp": 2095,
      "ifdef": 2096,
      "Ġprimitive": 2097,
      "0003": 2098,
      "Ġmay": 2099,
      "ĠAl": 2100,
      "ĠPins": 2101,
      "Ġens": 2102,
      "Ġbyte": 2103,
      "Ġ\"\",": 2104,
      "ized": 2105,
      "Ġclocks": 2106,
      "ĠName": 2107,
      "Ġchecking": 2108,
      "config": 2109,
      "Ġsee": 2110,
      "Ġmore": 2111,
      "ĠRegisters": 2112,
      "--------------": 2113,
      "-------------|": 2114,
      "Ġhandshake": 2115,
      "Ġidx": 2116,
      "ĠMemInitFile": 2117,
      "SingleErrorDetectR": 2118,
      "Ġclass": 2119,
      "ĠRaclErrorRsp": 2120,
      "|:----------------------------------------------------------------": 2121,
      "scanmode": 2122,
      "pgaBufG": 2123,
      "rypto": 2124,
      "23": 2125,
      "FE": 2126,
      "ns": 2127,
      "policy": 2128,
      "word": 2129,
      "ĢâĶ": 2130,
      "ers": 2131,
      "Ġinject": 2132,
      "Ġpwr": 2133,
      "Ġcnt": 2134,
      "hether": 2135,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 2136,
      "Ġremo": 2137,
      "Ġredu": 2138,
      "coding": 2139,
      "---------": 2140,
      "Ġmux": 2141,
      "grap": 2142,
      "Ġ*/": 2143,
      "Ġstand": 2144,
      "Ġuses": 2145,
      "ĠLFSR": 2146,
      "ranularity": 2147,
      "ĠNumC": 2148,
      "Development": 2149,
      "escalate": 2150,
      "ĠSource": 2151,
      "Ġ(.*);": 2152,
      "Ġmultiple": 2153,
      "Ġinformation": 2154,
      "BusAddrW": 2155,
      "04": 2156,
      "LASH": 2157,
      "bn": 2158,
      "bus": 2159,
      "ld": 2160,
      "pend": 2161,
      "size": 2162,
      "skew": 2163,
      "sender": 2164,
      "the": 2165,
      "yle": 2166,
      "ze": 2167,
      "Ġins": 2168,
      "Ġtemp": 2169,
      "-->": 2170,
      "ances": 2171,
      "round": 2172,
      "Ġwell": 2173,
      "003": 2174,
      "ipe": 2175,
      "Ġneg": 2176,
      "ither": 2177,
      "iod": 2178,
      "write": 2179,
      "arts": 2180,
      "apt": 2181,
      "FFFFF": 2182,
      "ĠLength": 2183,
      "Ġvc": 2184,
      "Ġinitialize": 2185,
      "Ġpattgen": 2186,
      "ĠManual": 2187,
      "ĠEDN": 2188,
      ".[`": 2189,
      "256": 2190,
      "Granularity": 2191,
      "ND": 2192,
      "OpenTitan": 2193,
      "Policy": 2194,
      "SIZE": 2195,
      "].": 2196,
      "aes": 2197,
      "disable": 2198,
      "ty": 2199,
      "vbits": 2200,
      "wkup": 2201,
      "ines": 2202,
      "reak": 2203,
      "Ġafter": 2204,
      "Ġperf": 2205,
      "atal": 2206,
      "attr": 2207,
      "icated": 2208,
      "Ġcor": 2209,
      "ime": 2210,
      "Ġsize": 2211,
      "Ġbuild": 2212,
      "Ġfl": 2213,
      "Ġwhether": 2214,
      "ĠTop": 2215,
      "ipel": 2216,
      "ĠPart": 2217,
      "ĠOffset": 2218,
      "Ġstored": 2219,
      "cept": 2220,
      "resh": 2221,
      "000000": 2222,
      "ĠFPGA": 2223,
      "coming": 2224,
      "ĠNoF": 2225,
      "ĠInit": 2226,
      "bitr": 2227,
      "ranch": 2228,
      "Ġatt": 2229,
      "Ġshadowed": 2230,
      "Ġgenerate": 2231,
      "Ġenabled": 2232,
      "Ġboot": 2233,
      "Ġidle": 2234,
      "Ġdma": 2235,
      "////////////////////////////////////////": 2236,
      "Ġclr": 2237,
      "masked": 2238,
      "Ġarbitr": 2239,
      "Ġprovides": 2240,
      "---------|---------": 2241,
      "Ġagain": 2242,
      "verride": 2243,
      "---------|---------:": 2244,
      "41": 2245,
      "Div": 2246,
      "Domain": 2247,
      "IM": 2248,
      "RISC": 2249,
      "RCE": 2250,
      "Specification": 2251,
      "SOU": 2252,
      "TE": 2253,
      "]),": 2254,
      "`.": 2255,
      "be": 2256,
      "cause": 2257,
      "kmac": 2258,
      "oe": 2259,
      "ose": 2260,
      "pre": 2261,
      "ry": 2262,
      "Ġback": 2263,
      "Ġ(!": 2264,
      "Ġintegr": 2265,
      "Ġwork": 2266,
      "Ġ12": 2267,
      "ĠSW": 2268,
      "ĠCrash": 2269,
      "Ġhash": 2270,
      "olution": 2271,
      "indow": 2272,
      "ious": 2273,
      "otbn": 2274,
      "00000": 2275,
      "Ġcomment": 2276,
      "ĠInterrupt": 2277,
      "Ġprogram": 2278,
      "ĠInfo": 2279,
      "control": 2280,
      "Ġexample": 2281,
      "ffect": 2282,
      "Ġchild": 2283,
      "Ġrequests": 2284,
      "Ġsync": 2285,
      "MAC": 2286,
      "33366": 2287,
      "AAAD": 2288,
      "OTE": 2289,
      "checker": 2290,
      "ĠRaclPolicy": 2291,
      "Ġseparately": 2292,
      "ĢâĶĢâĶ": 2293,
      "Domains": 2294,
      "SOURCE": 2295,
      "65": 2296,
      "Harts": 2297,
      "Res": 2298,
      "TX": 2299,
      "]&": 2300,
      "cyc": 2301,
      "lfsr": 2302,
      "oid": 2303,
      "ring": 2304,
      "vis": 2305,
      "wb": 2306,
      "zero": 2307,
      "Ġcmd": 2308,
      "Ġcurrent": 2309,
      "Ġcrypto": 2310,
      "ities": 2311,
      "Ġbut": 2312,
      "Ġoutputs": 2313,
      "ĠSY": 2314,
      "ĠSw": 2315,
      "ĠSram": 2316,
      "Ġnet": 2317,
      "NumC": 2318,
      "opies": 2319,
      "Ġlink": 2320,
      "ĠThese": 2321,
      "ĠGATE": 2322,
      "ĠGPIO": 2323,
      "fast": 2324,
      "aster": 2325,
      "Ġinstantiated": 2326,
      "tributes": 2327,
      "Ġdepend": 2328,
      "ailable": 2329,
      "pwrup": 2330,
      "fix": 2331,
      "ĠAdd": 2332,
      "Ġstandard": 2333,
      "Ġperform": 2334,
      "ĠRaclPolicySel": 2335,
      "800": 2336,
      "CK": 2337,
      "For": 2338,
      "FLASH": 2339,
      "LC": 2340,
      "LEN": 2341,
      "NOTE": 2342,
      "Un": 2343,
      "YP": 2344,
      "are": 2345,
      "break": 2346,
      "dn": 2347,
      "ead": 2348,
      "iated": 2349,
      "meas": 2350,
      "our": 2351,
      "ook": 2352,
      "pat": 2353,
      "pack": 2354,
      "pwm": 2355,
      "ĠĠĠĠčĊ": 2356,
      "inx": 2357,
      "Ġtx": 2358,
      "rect": 2359,
      "Ġap": 2360,
      "Ġabo": 2361,
      "Ġcre": 2362,
      "Ġsc": 2363,
      "Ġsrc": 2364,
      "Ġdut": 2365,
      "Ġracl": 2366,
      "Ġrandom": 2367,
      "pkt": 2368,
      "erted": 2369,
      "idx": 2370,
      "Ġmet": 2371,
      "ilinx": 2372,
      "upd": 2373,
      "ĠMH": 2374,
      "apter": 2375,
      "ĠWhen": 2376,
      "trans": 2377,
      "ĠEnSec": 2378,
      "hare": 2379,
      "ĠEnables": 2380,
      "Ġtimer": 2381,
      "chronous": 2382,
      "Ġmasking": 2383,
      "Ġreference": 2384,
      "Ġfield": 2385,
      "Ġdumm": 2386,
      "ĠSoftware": 2387,
      "Ġusbdev": 2388,
      "ĠRndCnstLfsr": 2389,
      "ĠOnce": 2390,
      "ibrary": 2391,
      "Ġpos": 2392,
      "Ġcopied": 2393,
      "Ġconstants": 2394,
      "ĠModel": 2395,
      "Ġremove": 2396,
      "apture": 2397,
      "Ġagainst": 2398,
      "80": 2399,
      "BIN": 2400,
      "Ex": 2401,
      "GPIO": 2402,
      "Rst": 2403,
      "Src": 2404,
      "US": 2405,
      "af": 2406,
      "alog": 2407,
      "ful": 2408,
      "free": 2409,
      "ield": 2410,
      "ma": 2411,
      "por": 2412,
      "Ġ~": 2413,
      "loc": 2414,
